# Задача 1:
def izi(n): # Функция проверки числа: простое или нет.
    for i in range (2, int(n**0.5)+1):# Мы начинаем проверку от 2, так как все числа делятся на 1 (всегда будет возвращаться False.
                                # Провека до корня из числа + 1, так как все делители парные: если нет делителя в первой половине, то нет и во второй.
        if n%i==0: # Проврка на делимость.
            return False # Если существует делитель, то возвращаем False.
    return True # Если мы ни разу не зашли в if, то возращаем True.

for i in range(1, 1001): # Цикл по заданному диапазону до 1001, так как правая граница не включается, поэтому последнее число в цикле 1000.
    if izi(i): # Проверка функции.
        print("Из нее льет я PUSSY BOY") # Это Егооор Крииииид.
        print(i) # Вывод числа.

# Задача 2:
from fnmatch import fnmatch # Импорт функции.
k=0 # Заводим счетчик.
for i in range (248650040790, 248665000000): # Так как перебор довольно большой, то границы
                                            # вычислены по первым числам айпи адреса.
    if fnmatch(str(i), '24865*4?79?') and len(str(i))==12: # Проверка на совпадение с маской
                                                            # и провека длины.
        k+=1 # Прибавляем счетчик.
print(k) # Вывод количества подходящих чисел.

# Задача 3:
def izi(n): # Функция проверки числа: простое или нет.
    for i in range (2, int(n**0.5)+1):# Мы начинаем проверку от 2, так как все числа делятся на 1 (всегда будет возвращаться False.
                                # Провека до корня из числа + 1, так как все делители парные: если нет делителя в первой половине, то нет и во второй.
        if n%i==0: # Проврка на делимость.
            return False # Если существует делитель, то возвращаем False.
    return True # Если мы ни разу не зашли в if, то возращаем True.

kol=0 # Счетчик для вывода нужного количества чисел.
for i in range (500001, 10**10+1): # Левая граница начинается от 500001, так как больших 500000 (500000 не учитывается).
    a=[] # Массив для простых делителей.
    for d in range (2, int(i**0.5)+1): # Границы определяются аналогично границам перебора делителей в функции изи.
        if i%d==0: # Проверка н аделимость.
            if izi(d): # Проверка на принадлежность делителя к простым числам
                a.append(d) # Если обе проверки выполняются, то записываем делитель в массив.
            if izi(i//d): # Проверка парного делителя на принадлежность простым числам.
                a.append(i//d) # Если обе проверки выполняются, то записываем делитель в массив.
                break # Если мы нашли первый просто делитель с правой стороны (идем в порядке убывания, так как проверяем парные делители),
                      # то это и будет максимальный простой делитель.
    if len(a)!=0: # Проверяем что простые делители существуют.
        if (max(a)-min(a))%43==12: # Проверка основного условия.
            print(i) # Вывод числа.
            kol+=1 # Увеличиваем счетчик.
        if kol>=7: # Проверяем, сколько чисел мы вывели.
            break # Выход из обдщего цикла, когда вывели 7 чисел.
        
